cool/tutorials/multiphase/barotropicCavitatingFoam/nozzle/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -3 0 0 0 0 0];

internalField       uniform 1000;

boundaryField
{
    in
    {
        type            zeroGradient;
    }
    out
    {
        type            zeroGradient;
    }
    bottom
    {
        type            symmetryPlane;
    }
    topWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************** //
