cool/tutorials/multiphase/barotropicCavitatingFoam/nozzle/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="barotropicCavitatingFoam"

runApplication blockMesh
runApplication $application
