cool/tutorials/multiphase/barotropicCavitatingFoam/nozzle/constant/thermodynamicProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermodynamicProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhogSat                       rhogSat    [1 -3 0 0 0]     0.345;
rholSat                       rholSat    [1 -3 0 0 0]     1000;
pSat                          pSat       [1 -1 -2 0 0]    3000;
psig                          psig       [0 -2 2 0 0]     2.5e-5;
psil                          psil       [0 -2 2 0 0]     5.5775e-7;

// ************************************************************************* //
